---
kind: other
id: Properties.T:Autodesk.Revit.DB.Events.DocumentSavingEventArgs
source: html/b6b1d35c-3ef0-2809-8731-c6d5982510f8.htm
---
# DocumentSavingEventArgs Properties

Indicates whether an event may be cancelled by an event delegate.